jumboartgallery/app/controllers/artworks_controller.rb

SELECT `artworks`.* FROM `artworks` WHERE `artworks`.`id` = 1 LIMIT 1
---
  def getlatlng(id)
  	@last_buildings = Array.new
  	@artwork = Artwork.find(id)