jumboartgallery/app/controllers/tours_controller.rb

SELECT `tours`.* FROM `tours`
---
  def index
    @tours = Tour.all