jumboartgallery/app/views/tours/index.mobile.erb

SELECT `artworks`.* FROM `artworks` INNER JOIN `tour_items` ON `artworks`.id = `tour_items`.artwork_id WHERE ((`tour_items`.tour_id = 18))
---
		<ul data-role="listview">
		<% tour.artwork.each do |art| %>