tuftsartgallery/app/controllers/artworks_controller.rb

SELECT `artworks`.* FROM `artworks` ORDER BY title ASC
SELECT DISTINCT(creator) FROM `artworks` ORDER BY creator ASC
SELECT DISTINCT(object) FROM `artworks` ORDER BY object ASC
SELECT DISTINCT(location) FROM `artworks` ORDER BY location ASC
---
  def index
    @artworks = Artwork.all(:order => 'title ASC')
    @artists = Artwork.select("DISTINCT(creator)").order("creator ASC")
    @types = Artwork.select("DISTINCT(object)").order("object ASC")
    @locations = Artwork.select("DISTINCT(location)").order("location ASC")

SELECT `artworks`.* FROM `artworks` WHERE `artworks`.`title` = 'Kitchen Wall, Alabama, Farmstead, 1936' GROUP BY title
---
  def view_cat
    @current_cat = "Browsing: " + params[:value]
    @artworks_by_cat = Artwork.where(params[:category] => params[:value]).all(:order => 'title ASC')

SELECT `artworks`.* FROM `artworks` WHERE `artworks`.`id` = 1 LIMIT 1
---
  def show
    @artwork = Artwork.find(params[:id])